susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32WB35x.h
/*
 * This file is automatically generated by afTable.py from the xml descriptions provided as part of the STM32Cube IDE
 * Timestamp: 2023-12-12T18:58:56.526291
 */

#ifndef LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION
#define LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION

#define CM4_EVENTOUT_PA0_ PA0,GPIO_AF15
#define CM4_EVENTOUT_PA1_ PA1,GPIO_AF15
#define CM4_EVENTOUT_PA10_ PA10,GPIO_AF15
#define CM4_EVENTOUT_PA11_ PA11,GPIO_AF15
#define CM4_EVENTOUT_PA12_ PA12,GPIO_AF15
#define CM4_EVENTOUT_PA13_ PA13,GPIO_AF15
#define CM4_EVENTOUT_PA14_ PA14,GPIO_AF15
#define CM4_EVENTOUT_PA15_ PA15,GPIO_AF15
#define CM4_EVENTOUT_PA2_ PA2,GPIO_AF15
#define CM4_EVENTOUT_PA3_ PA3,GPIO_AF15
#define CM4_EVENTOUT_PA4_ PA4,GPIO_AF15
#define CM4_EVENTOUT_PA5_ PA5,GPIO_AF15
#define CM4_EVENTOUT_PA6_ PA6,GPIO_AF15
#define CM4_EVENTOUT_PA7_ PA7,GPIO_AF15
#define CM4_EVENTOUT_PA8_ PA8,GPIO_AF15
#define CM4_EVENTOUT_PA9_ PA9,GPIO_AF15
#define CM4_EVENTOUT_PB0_ PB0,GPIO_AF15
#define CM4_EVENTOUT_PB1_ PB1,GPIO_AF15
#define CM4_EVENTOUT_PB10_ PB10,GPIO_AF15
#define CM4_EVENTOUT_PB12_ PB12,GPIO_AF15
#define CM4_EVENTOUT_PB13_ PB13,GPIO_AF15
#define CM4_EVENTOUT_PB14_ PB14,GPIO_AF15
#define CM4_EVENTOUT_PB15_ PB15,GPIO_AF15
#define CM4_EVENTOUT_PB2_ PB2,GPIO_AF15
#define CM4_EVENTOUT_PB3_ PB3,GPIO_AF15
#define CM4_EVENTOUT_PB4_ PB4,GPIO_AF15
#define CM4_EVENTOUT_PB5_ PB5,GPIO_AF15
#define CM4_EVENTOUT_PB6_ PB6,GPIO_AF15
#define CM4_EVENTOUT_PB7_ PB7,GPIO_AF15
#define CM4_EVENTOUT_PB8_ PB8,GPIO_AF15
#define CM4_EVENTOUT_PB9_ PB9,GPIO_AF15
#define CM4_EVENTOUT_PC1_ PC1,GPIO_AF15
#define CM4_EVENTOUT_PC14_ PC14,GPIO_AF15
#define CM4_EVENTOUT_PC15_ PC15,GPIO_AF15
#define CM4_EVENTOUT_PE4_ PE4,GPIO_AF15
#define CM4_EVENTOUT_PH3_ PH3,GPIO_AF15
#define _CM4_EVENTOUT_PA0_ 1
#define _CM4_EVENTOUT_PA1_ 1
#define _CM4_EVENTOUT_PA10_ 1
#define _CM4_EVENTOUT_PA11_ 1
#define _CM4_EVENTOUT_PA12_ 1
#define _CM4_EVENTOUT_PA13_ 1
#define _CM4_EVENTOUT_PA14_ 1
#define _CM4_EVENTOUT_PA15_ 1
#define _CM4_EVENTOUT_PA2_ 1
#define _CM4_EVENTOUT_PA3_ 1
#define _CM4_EVENTOUT_PA4_ 1
#define _CM4_EVENTOUT_PA5_ 1
#define _CM4_EVENTOUT_PA6_ 1
#define _CM4_EVENTOUT_PA7_ 1
#define _CM4_EVENTOUT_PA8_ 1
#define _CM4_EVENTOUT_PA9_ 1
#define _CM4_EVENTOUT_PB0_ 1
#define _CM4_EVENTOUT_PB1_ 1
#define _CM4_EVENTOUT_PB10_ 1
#define _CM4_EVENTOUT_PB12_ 1
#define _CM4_EVENTOUT_PB13_ 1
#define _CM4_EVENTOUT_PB14_ 1
#define _CM4_EVENTOUT_PB15_ 1
#define _CM4_EVENTOUT_PB2_ 1
#define _CM4_EVENTOUT_PB3_ 1
#define _CM4_EVENTOUT_PB4_ 1
#define _CM4_EVENTOUT_PB5_ 1
#define _CM4_EVENTOUT_PB6_ 1
#define _CM4_EVENTOUT_PB7_ 1
#define _CM4_EVENTOUT_PB8_ 1
#define _CM4_EVENTOUT_PB9_ 1
#define _CM4_EVENTOUT_PC1_ 1
#define _CM4_EVENTOUT_PC14_ 1
#define _CM4_EVENTOUT_PC15_ 1
#define _CM4_EVENTOUT_PE4_ 1
#define _CM4_EVENTOUT_PH3_ 1

#define COMP1_OUT_PA0_ PA0,GPIO_AF12
#define COMP1_OUT_PB0_ PB0,GPIO_AF12
#define _COMP1_OUT_PA0_ 1
#define _COMP1_OUT_PB0_ 1

#define I2C1_SCL_PA9_ PA9,GPIO_AF4
#define I2C1_SCL_PB6_ PB6,GPIO_AF4
#define I2C1_SCL_PB8_ PB8,GPIO_AF4
#define _I2C1_SCL_PA9_ 1
#define _I2C1_SCL_PB6_ 1
#define _I2C1_SCL_PB8_ 1

#define I2C1_SDA_PA10_ PA10,GPIO_AF4
#define I2C1_SDA_PB7_ PB7,GPIO_AF4
#define I2C1_SDA_PB9_ PB9,GPIO_AF4
#define _I2C1_SDA_PA10_ 1
#define _I2C1_SDA_PB7_ 1
#define _I2C1_SDA_PB9_ 1

#define I2C1_SMBA_PA1_ PA1,GPIO_AF4
#define I2C1_SMBA_PA14_ PA14,GPIO_AF4
#define I2C1_SMBA_PB5_ PB5,GPIO_AF4
#define _I2C1_SMBA_PA1_ 1
#define _I2C1_SMBA_PA14_ 1
#define _I2C1_SMBA_PB5_ 1

#define LPTIM1_ETR_PB6_ PB6,GPIO_AF1
#define _LPTIM1_ETR_PB6_ 1

#define LPTIM1_IN1_PB5_ PB5,GPIO_AF1
#define _LPTIM1_IN1_PB5_ 1

#define LPTIM1_IN2_PB7_ PB7,GPIO_AF1
#define _LPTIM1_IN2_PB7_ 1

#define LPTIM1_OUT_PA14_ PA14,GPIO_AF1
#define LPTIM1_OUT_PB2_ PB2,GPIO_AF1
#define _LPTIM1_OUT_PA14_ 1
#define _LPTIM1_OUT_PB2_ 1

#define LPTIM2_ETR_PA5_ PA5,GPIO_AF14
#define _LPTIM2_ETR_PA5_ 1

#define LPTIM2_IN1_PB1_ PB1,GPIO_AF14
#define _LPTIM2_IN1_PB1_ 1

#define LPTIM2_OUT_PA4_ PA4,GPIO_AF14
#define LPTIM2_OUT_PA8_ PA8,GPIO_AF14
#define _LPTIM2_OUT_PA4_ 1
#define _LPTIM2_OUT_PA8_ 1

#define LPUART1_CTS_PA6_ PA6,GPIO_AF8
#define _LPUART1_CTS_PA6_ 1

#define LPUART1_DE_PB1_ PB1,GPIO_AF8
#define _LPUART1_DE_PB1_ 1

#define LPUART1_RTS_PB1_ PB1,GPIO_AF8
#define _LPUART1_RTS_PB1_ 1

#define LPUART1_RX_PA12_ PA12,GPIO_AF8
#define LPUART1_RX_PA3_ PA3,GPIO_AF8
#define _LPUART1_RX_PA12_ 1
#define _LPUART1_RX_PA3_ 1

#define LPUART1_TX_PA2_ PA2,GPIO_AF8
#define LPUART1_TX_PB5_ PB5,GPIO_AF8
#define _LPUART1_TX_PA2_ 1
#define _LPUART1_TX_PB5_ 1

#define RCC_LSCO_PA2_ PA2,GPIO_AF0
#define RCC_LSCO_PH3_ PH3,GPIO_AF0
#define _RCC_LSCO_PA2_ 1
#define _RCC_LSCO_PH3_ 1

#define RCC_MCO_PA15_ PA15,GPIO_AF6
#define RCC_MCO_PA8_ PA8,GPIO_AF0
#define RCC_MCO_PB6_ PB6,GPIO_AF0
#define _RCC_MCO_PA15_ 1
#define _RCC_MCO_PA8_ 1
#define _RCC_MCO_PB6_ 1

#define RF_TX_MOD_EXT_PA_PB0_ PB0,GPIO_AF6
#define _RF_TX_MOD_EXT_PA_PB0_ 1

#define RTC_OUT_PB2_ PB2,GPIO_AF0
#define _RTC_OUT_PB2_ 1

#define SPI1_MISO_PA11_ PA11,GPIO_AF5
#define SPI1_MISO_PA6_ PA6,GPIO_AF5
#define SPI1_MISO_PB4_ PB4,GPIO_AF5
#define _SPI1_MISO_PA11_ 1
#define _SPI1_MISO_PA6_ 1
#define _SPI1_MISO_PB4_ 1

#define SPI1_MOSI_PA12_ PA12,GPIO_AF5
#define SPI1_MOSI_PA13_ PA13,GPIO_AF5
#define SPI1_MOSI_PA5_ PA5,GPIO_AF4
#define SPI1_MOSI_PA7_ PA7,GPIO_AF5
#define SPI1_MOSI_PB5_ PB5,GPIO_AF5
#define _SPI1_MOSI_PA12_ 1
#define _SPI1_MOSI_PA13_ 1
#define _SPI1_MOSI_PA5_ 1
#define _SPI1_MOSI_PA7_ 1
#define _SPI1_MOSI_PB5_ 1

#define SPI1_NSS_PA14_ PA14,GPIO_AF5
#define SPI1_NSS_PA15_ PA15,GPIO_AF5
#define SPI1_NSS_PA4_ PA4,GPIO_AF5
#define SPI1_NSS_PB2_ PB2,GPIO_AF5
#define SPI1_NSS_PB6_ PB6,GPIO_AF5
#define _SPI1_NSS_PA14_ 1
#define _SPI1_NSS_PA15_ 1
#define _SPI1_NSS_PA4_ 1
#define _SPI1_NSS_PB2_ 1
#define _SPI1_NSS_PB6_ 1

#define SPI1_SCK_PA1_ PA1,GPIO_AF5
#define SPI1_SCK_PA5_ PA5,GPIO_AF5
#define SPI1_SCK_PB3_ PB3,GPIO_AF5
#define _SPI1_SCK_PA1_ 1
#define _SPI1_SCK_PA5_ 1
#define _SPI1_SCK_PB3_ 1

#define SYS_JTCK_SWCLK_PA14_ PA14,GPIO_AF0
#define _SYS_JTCK_SWCLK_PA14_ 1

#define SYS_JTDI_PA15_ PA15,GPIO_AF0
#define _SYS_JTDI_PA15_ 1

#define SYS_JTDO_SWO_PB3_ PB3,GPIO_AF0
#define _SYS_JTDO_SWO_PB3_ 1

#define SYS_JTMS_SWDIO_PA13_ PA13,GPIO_AF0
#define _SYS_JTMS_SWDIO_PA13_ 1

#define SYS_JTRST_PB4_ PB4,GPIO_AF0
#define _SYS_JTRST_PB4_ 1

#define TIM1_BKIN_PA6_ PA6,GPIO_AF1
#define TIM1_BKIN_PB7_ PB7,GPIO_AF3
#define _TIM1_BKIN_PA6_ 1
#define _TIM1_BKIN_PB7_ 1

#define TIM1_BKIN2_PA11_ PA11,GPIO_AF2
#define _TIM1_BKIN2_PA11_ 1

#define TIM1_CH1_PA8_ PA8,GPIO_AF1
#define TIM1_CH1_PB14_ PB14,GPIO_AF1
#define _TIM1_CH1_PA8_ 1
#define _TIM1_CH1_PB14_ 1

#define TIM1_CH1N_PA7_ PA7,GPIO_AF1
#define _TIM1_CH1N_PA7_ 1

#define TIM1_CH2_PA9_ PA9,GPIO_AF1
#define _TIM1_CH2_PA9_ 1

#define TIM1_CH2N_PB8_ PB8,GPIO_AF1
#define _TIM1_CH2N_PB8_ 1

#define TIM1_CH3_PA10_ PA10,GPIO_AF1
#define TIM1_CH3_PB7_ PB7,GPIO_AF12
#define _TIM1_CH3_PA10_ 1
#define _TIM1_CH3_PB7_ 1

#define TIM1_CH3N_PB9_ PB9,GPIO_AF1
#define _TIM1_CH3N_PB9_ 1

#define TIM1_CH4_PA11_ PA11,GPIO_AF1
#define _TIM1_CH4_PA11_ 1

#define TIM1_ETR_PA12_ PA12,GPIO_AF1
#define _TIM1_ETR_PA12_ 1

#define TIM2_CH1_PA0_ PA0,GPIO_AF1
#define TIM2_CH1_PA15_ PA15,GPIO_AF1
#define TIM2_CH1_PA5_ PA5,GPIO_AF1
#define TIM2_CH1_PB15_ PB15,GPIO_AF1
#define _TIM2_CH1_PA0_ 1
#define _TIM2_CH1_PA15_ 1
#define _TIM2_CH1_PA5_ 1
#define _TIM2_CH1_PB15_ 1

#define TIM2_CH2_PA1_ PA1,GPIO_AF1
#define TIM2_CH2_PB12_ PB12,GPIO_AF1
#define TIM2_CH2_PB3_ PB3,GPIO_AF1
#define _TIM2_CH2_PA1_ 1
#define _TIM2_CH2_PB12_ 1
#define _TIM2_CH2_PB3_ 1

#define TIM2_CH3_PA2_ PA2,GPIO_AF1
#define TIM2_CH3_PB13_ PB13,GPIO_AF1
#define _TIM2_CH3_PA2_ 1
#define _TIM2_CH3_PB13_ 1

#define TIM2_CH4_PA3_ PA3,GPIO_AF1
#define _TIM2_CH4_PA3_ 1

#define TIM2_ETR_PA0_ PA0,GPIO_AF14
#define TIM2_ETR_PA15_ PA15,GPIO_AF2
#define TIM2_ETR_PA5_ PA5,GPIO_AF2
#define _TIM2_ETR_PA0_ 1
#define _TIM2_ETR_PA15_ 1
#define _TIM2_ETR_PA5_ 1

#define TSC_G1_IO1_PB12_ PB12,GPIO_AF9
#define _TSC_G1_IO1_PB12_ 1

#define TSC_G1_IO2_PB13_ PB13,GPIO_AF9
#define _TSC_G1_IO2_PB13_ 1

#define TSC_G2_IO1_PB4_ PB4,GPIO_AF9
#define _TSC_G2_IO1_PB4_ 1

#define TSC_G2_IO2_PB5_ PB5,GPIO_AF9
#define _TSC_G2_IO2_PB5_ 1

#define TSC_G2_IO3_PB6_ PB6,GPIO_AF9
#define _TSC_G2_IO3_PB6_ 1

#define TSC_G2_IO4_PB7_ PB7,GPIO_AF9
#define _TSC_G2_IO4_PB7_ 1

#define TSC_G3_IO1_PA15_ PA15,GPIO_AF9
#define _TSC_G3_IO1_PA15_ 1

#define TSC_G3_IO2_PB10_ PB10,GPIO_AF9
#define _TSC_G3_IO2_PB10_ 1

#define TSC_G3_IO3_PC1_ PC1,GPIO_AF9
#define _TSC_G3_IO3_PC1_ 1

#define TSC_G7_IO1_PA13_ PA13,GPIO_AF9
#define _TSC_G7_IO1_PA13_ 1

#define TSC_G7_IO2_PA10_ PA10,GPIO_AF9
#define _TSC_G7_IO2_PA10_ 1

#define TSC_G7_IO3_PB8_ PB8,GPIO_AF9
#define _TSC_G7_IO3_PB8_ 1

#define TSC_G7_IO4_PB9_ PB9,GPIO_AF9
#define _TSC_G7_IO4_PB9_ 1

#define UART1_CK_PA8_ PA8,GPIO_AF7
#define UART1_CK_PB5_ PB5,GPIO_AF7
#define _UART1_CK_PA8_ 1
#define _UART1_CK_PB5_ 1

#define UART1_CTS_PA11_ PA11,GPIO_AF7
#define UART1_CTS_PB4_ PB4,GPIO_AF7
#define _UART1_CTS_PA11_ 1
#define _UART1_CTS_PB4_ 1

#define UART1_DE_PA12_ PA12,GPIO_AF7
#define UART1_DE_PB3_ PB3,GPIO_AF7
#define _UART1_DE_PA12_ 1
#define _UART1_DE_PB3_ 1

#define UART1_NSS_PA11_ PA11,GPIO_AF7
#define UART1_NSS_PB4_ PB4,GPIO_AF7
#define _UART1_NSS_PA11_ 1
#define _UART1_NSS_PB4_ 1

#define UART1_RTS_PA12_ PA12,GPIO_AF7
#define UART1_RTS_PB3_ PB3,GPIO_AF7
#define _UART1_RTS_PA12_ 1
#define _UART1_RTS_PB3_ 1

#define UART1_RX_PA10_ PA10,GPIO_AF7
#define UART1_RX_PB7_ PB7,GPIO_AF7
#define _UART1_RX_PA10_ 1
#define _UART1_RX_PB7_ 1

#define UART1_TX_PA9_ PA9,GPIO_AF7
#define UART1_TX_PB6_ PB6,GPIO_AF7
#define _UART1_TX_PA9_ 1
#define _UART1_TX_PB6_ 1

#define UART2_CTS_PA6_ PA6,GPIO_AF8
#define _UART2_CTS_PA6_ 1

#define UART2_DE_PB1_ PB1,GPIO_AF8
#define _UART2_DE_PB1_ 1

#define UART2_RTS_PB1_ PB1,GPIO_AF8
#define _UART2_RTS_PB1_ 1

#define UART2_RX_PA12_ PA12,GPIO_AF8
#define UART2_RX_PA3_ PA3,GPIO_AF8
#define _UART2_RX_PA12_ 1
#define _UART2_RX_PA3_ 1

#define UART2_TX_PA2_ PA2,GPIO_AF8
#define UART2_TX_PB5_ PB5,GPIO_AF8
#define _UART2_TX_PA2_ 1
#define _UART2_TX_PB5_ 1

#define USART1_CK_PA8_ PA8,GPIO_AF7
#define USART1_CK_PB5_ PB5,GPIO_AF7
#define _USART1_CK_PA8_ 1
#define _USART1_CK_PB5_ 1

#define USART1_CTS_PA11_ PA11,GPIO_AF7
#define USART1_CTS_PB4_ PB4,GPIO_AF7
#define _USART1_CTS_PA11_ 1
#define _USART1_CTS_PB4_ 1

#define USART1_DE_PA12_ PA12,GPIO_AF7
#define USART1_DE_PB3_ PB3,GPIO_AF7
#define _USART1_DE_PA12_ 1
#define _USART1_DE_PB3_ 1

#define USART1_NSS_PA11_ PA11,GPIO_AF7
#define USART1_NSS_PB4_ PB4,GPIO_AF7
#define _USART1_NSS_PA11_ 1
#define _USART1_NSS_PB4_ 1

#define USART1_RTS_PA12_ PA12,GPIO_AF7
#define USART1_RTS_PB3_ PB3,GPIO_AF7
#define _USART1_RTS_PA12_ 1
#define _USART1_RTS_PB3_ 1

#define USART1_RX_PA10_ PA10,GPIO_AF7
#define USART1_RX_PB7_ PB7,GPIO_AF7
#define _USART1_RX_PA10_ 1
#define _USART1_RX_PB7_ 1

#define USART1_TX_PA9_ PA9,GPIO_AF7
#define USART1_TX_PB6_ PB6,GPIO_AF7
#define _USART1_TX_PA9_ 1
#define _USART1_TX_PB6_ 1

#endif /* LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION */